Repository: quarkusio/es.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: es_es

source: `Capabilities.isCapabilityWithPrefixPresent(prefix)` could be used to check whether a capability with a given prefix is present.
es_es: `Capabilities.isCapabilityWithPrefixPresent(prefix)` podría utilizarse para comprobar si una capacidad con un prefijo determinado está presente.

source: `IdentityProvider` converts the authentication credentials provided by `HttpAuthenticationMechanism` to a `SecurityIdentity` instance.
es_es: `IdentityProvider` convierte las credenciales de autenticación proporcionadas por `HttpAuthenticationMechanism` en una instancia de `SecurityIdentity`.

source: `Instant` or `UUID`
es_es: `Instant` o `UUID`

source: `Procfile` to configure how Heroku starts your application
es_es: `Procfile` para configurar cómo Heroku inicia su aplicación

source: `api-only` only starts a Kubernetes API Server. If you need a fully-featured Kubernetes cluster that can spin up Pods, you can use `k3s` or `kind`. Note that they both requires to run in Docker privileged mode.
es_es: `api-only` sólo inicia un servidor API Kubernetes. Si necesita un clúster Kubernetes con todas las funciones que puede girar Pods, puede utilizar `k3s` o `kind`. Tenga en cuenta que ambos requieren para ejecutar en modo privilegiado Docker.

source: `appName` - Use the default value. This is the application name in Azure. It must be a unique subdomain name under `*.azurewebsites.net`. Otherwise deploying to Azure will fail.
es_es: `appName` - Utilice el valor por defecto. Este es el nombre de la aplicación en Azure. Debe ser un nombre de subdominio único bajo `*.azurewebsites.net`. De lo contrario, el despliegue en Azure fallará.

source: `appRegion` - Defaults to `westus`. Dependent on your azure region.
es_es: `appRegion` - Por defecto, `westus`. Depende de su región azure.

source: `function` - Use the default which is `quarkus`. Name of your azure function. Can be anything you want.
es_es: `function` - Utilice el valor por defecto que es `quarkus`. Nombre de su función azure. Puede ser cualquier cosa que desee.

source: `groupId` - The maven groupId of this generated project. Type in `org.acme`.
es_es: `groupId` - El groupId de maven de este proyecto generado. Escriba en `org.acme`.

source: `mp.messaging.connector.smallrye-kafka.apicurio.registry.url` is configured
es_es: `mp.messaging.connector.smallrye-kafka.apicurio.registry.url` está configurado

source: `mp.messaging.connector.smallrye-kafka.schema.registry.url` is configured
es_es: `mp.messaging.connector.smallrye-kafka.apicurio.registry.url` está configurado

source: `providesIf` allows listing multiple `<positive>` as well as `<negative>` elements.
es_es: `providesIf` permite listar múltiples elementos `<positive>` así como `<negative>`.

source: `quarkus.amqp.devservices.enabled` is set to `false`
es_es: `quarkus.amqp.devservices.enabled` se ajusta a `false`

source: `quarkus.apicurio-registry.devservices.enabled` is set to `false`
es_es: `quarkus.apicurio-registry.devservices.enabled` se ajusta a `false`

source: `quarkus.devservices.enabled` is set to `false`.
es_es: `quarkus.devservices.enabled` se fija en `false`.

source: `quarkus.elasticsearch.devservices.enabled` is set to `false`
es_es: `quarkus.elasticsearch.devservices.enabled` se ajusta a `false`

source: `quarkus.funqy.knative-events.mapping.{function name}.resource-source` sets the Cloud Event source of the response
es_es: `quarkus.funqy.knative-events.mapping.{function name}.resource-source` establece la fuente de eventos de la nube de la respuesta

source: `quarkus.funqy.knative-events.mapping.{function name}.response-type` sets the Cloud Event type of the response
es_es: `quarkus.funqy.knative-events.mapping.{function name}.response-type` establece el tipo de evento de nube de la respuesta

source: `quarkus.funqy.knative-events.mapping.{function name}.trigger` sets the Cloud Event type that triggers a specific function. It is possible to use the special value `*` as a catch-all value. The function will in this case be used for all event types.
es_es: `quarkus.funqy.knative-events.mapping.{function name}.trigger` establece el tipo de Evento de Nube que desencadena una función específica. Es posible utilizar el valor especial `*` como valor general. En este caso, la función se utilizará para todos los tipos de eventos.

source: `quarkus.kafka.devservices.enabled` is set to `false`
es_es: `quarkus.kafka.devservices.enabled` se ajusta a `false`

source: `quarkus.kubernetes-client.devservices.enabled` is set to `false`
es_es: `quarkus.kubernetes-client.devservices.enabled` se establece en `false`

source: `quarkus.rabbitmq.devservices.enabled` is set to `false`
es_es: `quarkus.rabbitmq.devservices.enabled` se ajusta a `false`

source: `resourceGroup` - Use the default value. Any value is fine though.
es_es: `resourceGroup` - Utilice el valor por defecto. Sin embargo, cualquier valor es válido.

source: `system.properties` to configure the Java version
es_es: `system.properties` para configurar la versión de Java

source: `upx` can compress executables using a different architecture and OS than your host machine. For example, `upx` on a macOS machine can compress a Linux 64-bits executables.
es_es: `upx` puede comprimir ejecutables que utilicen una arquitectura y un sistema operativo diferentes a los de su máquina anfitriona. Por ejemplo, `upx` en una máquina MacOS X puede comprimir los ejecutables de Linux 64bits.

source: a landing page that is accessible on `http://localhost:8080` after starting the application
es_es: una página inicial que es accesible en `&lt;a href="http://localhost:8080" class="bare"&gt;http://localhost:8080&lt;/a&gt;` después de iniciar la aplicación

source: a valid Kube config file is found and `quarkus.kubernetes-client.devservices.override-kubeconfig` is not set to `true`
es_es: se encuentra un archivo de configuración de Kube válido y `quarkus.kubernetes-client.devservices.override-kubeconfig` no está configurado como `true`

source: add your changeLog to the `{change-log}` file as you usually do with Liquibase
es_es: añada su changeLog al archivo `{change-log}` como suele hacer con Liquibase

source: all the Reactive Messaging AMQP channels have the `host` or `port` attributes set
es_es: todos los canales AMQP de Mensajería Reactiva tienen establecidos los atributos `host` o `port`

source: all the Reactive Messaging Kafka channels have either the `apicurio.registry.url` attribute or the `schema.registry.url` attribute set
es_es: todos los canales de Kafka de Mensajería Reactiva tienen el atributo `apicurio.registry.url` establecido

source: all the Reactive Messaging Kafka channels have the `bootstrap.servers` attribute set
es_es: todos los canales de Kafka de Mensajería Reactiva tienen el atributo `bootstrap.servers` establecido

source: all the Reactive Messaging RabbitMQ channels have the `host` or `port` attributes set
es_es: todos los canales de Reactive Messaging RabbitMQ tienen los atributos `host` o `port` establecidos

source: allows plain-text communication as well as TLS, and TLS with mutual authentication
es_es: permite la comunicación en texto plano, así como TLS, y TLS con autenticación mutua

source: an `enforcedPlatform` directive for the Quarkus BOM
es_es: una directiva `enforcedPlatform` para Quarkus BOM

source: an `org.acme.GreetingResource` resource exposed on `/hello`
es_es: un recurso de `org.acme.GreetingResource` expuesto en `/hello`

source: an artifact key (in the format of `groupId:artifactId[:<classifier>:<extension>]` but typically simply `<groupId>:<artifactId>`) of the artifact that must be present among the application dependencies for the condition to be satisfied.
es_es: una clave de artefacto (con el formato de `groupId:artifactId[:<classifier>:<extension>]`, pero normalmente es simplemente `<groupId>:<artifactId>`) del artefacto que debe estar presente entre las dependencias de la aplicación para que se cumpla la condición.

source: an associated unit test
es_es: una prueba unitaria asociada

source: and more
es_es: y más

source: artifact coordinates of conditional dependencies on other extensions.
es_es: coordenadas del artefacto de las dependencias condicionales de otras extensiones.

source: ask your questions on https://stackoverflow.com/questions/tagged/quarkus[Stack Overflow].
es_es: hacer tus preguntas en https://stackoverflow.com/questions/tagged/quarkus[Stack Overflow].

source: building CLI tools, and you want to reduce the disk footprint,
es_es: construir herramientas CLI, y quiere reducir la huella del disco,

source: building small container images.
es_es: construir imágenes de contenedores pequeños.

source: condition that must be resolved to `true` by a class implementing `java.util.function.BooleanSupplier`
es_es: que debe ser resuelta en `true` por una clase que implemente `java.util.function.BooleanSupplier`

source: conditional dependency configuration element
es_es: elemento de configuración de dependencia condicional

source: configuration of the condition which will have to be satisfied for this extension to be included into a Quarkus application expressed as a list of artifacts that must be present among the application dependencies;
es_es: configuración de la condición que tendrá que ser satisfecha para que esta extensión sea incluida en una aplicación Quarkus expresada como una lista de artefactos que deben estar presentes entre las dependencias de la aplicación;

source: contains the right set of dependencies (glibc, libstdc++, zlib)
es_es: contiene el conjunto correcto de dependencias (glibc, libstdc++, zlib)

source: craft some code and https://github.com/quarkusio/quarkus/pulls[push a PR];
es_es: escribir algo de código y enviar https://github.com/quarkusio/quarkus/pulls[push a PR];

source: declaration of a conditional capability
es_es: declaración de una capacidad condicional

source: declares an optional Maven dependency on the deployment extension artifact `quarkus-extension-b-deployment`
es_es: declara una dependencia opcional de Maven en el artefacto de extensión del despliegue `quarkus-extension-b-deployment`

source: declares an optional Maven dependency on the runtime extension artifact `quarkus-extension-b`
es_es: declara una dependencia opcional de Maven del artefacto de extensión en tiempo de ejecución `quarkus-extension-b`

source: designed for containers
es_es: diseñado para contenedores

source: discuss with us on https://quarkusio.zulipchat.com/[Zulip] and on the https://groups.google.com/d/forum/quarkus-dev[mailing list];
es_es: comentar con nosotros en https://quarkusio.zulipchat.com/[Zulip] y en nuestra https://groups.google.com/d/forum/quarkus-dev[lista de correo];

source: enable the _development mode_ (hot reload)
es_es: activar el _modo de desarrollo_ (recarga en caliente)

source: example `Dockerfile` files for both `native` and `jvm` modes in `src/main/docker`
es_es: ejemplo `Dockerfile` archivos para los modos `native` y `jvm` en `src/main/docker`

source: false
es_es: falso

source: filter extensions
es_es: extensiones del filtro

source: how to compile your application natively
es_es: cómo compilar su aplicación de forma nativa

source: how to create and scaffold a new project
es_es: cómo crear y estructurar un nuevo proyecto

source: how to deal with extensions
es_es: cómo hacer frente a las extensiones

source: how to develop your application in your IDE
es_es: cómo desarrollar su aplicación en su IDE

source: how to enable live reload
es_es: cómo activar la recarga en vivo

source: how to set up Quarkus tools in xref:ide-tooling.adoc[Visual Studio Code, Eclipse IDE, Eclipse Che and IntelliJ IDEA]
es_es: cómo configurar las herramientas de Quarkus en xref:ide-tooling.adoc[Visual Studio Code, Eclipse IDE, Eclipse Che e IntelliJ]

source: how to use the xref:cli-tooling.adoc[CLI] for your toolchain
es_es: cómo utilizar la xref:cli-tooling.html[CLI] para su cadena de herramientas

source: how to use xref:gradle-tooling.adoc[Gradle] as a build tool
es_es: cómo utilizar xref:gradle-tooling.html[Gradle] como herramienta de construcción

source: how to use xref:maven-tooling.adoc[Maven] as a build tool
es_es: cómo utilizar xref:maven-tooling.html[Maven] como herramienta de construcción

source: https://adoptium.net/faq.html[Adoptium FAQ]
es_es: https://adoptium.net/faq.html[Preguntas frecuentes de Adoptium]

source: https://api.adoptium.net/q/swagger-ui/[Adoptium API]
es_es: https://api.adoptium.net/q/swagger-ui/[API de Adoptium]

source: https://azure.microsoft.com[An Azure Account]. Free accounts work.
es_es: https://azure.microsoft.com[Una cuenta de Azure]. Las cuentas gratuitas funcionan.

source: https://che.openshift.io/f?url=https://raw.githubusercontent.com/redhat-developer/devfile/master/getting-started/quarkus/devfile.yaml[Start Che Workspace]
es_es: https://che.openshift.io/f?url=https://raw.githubusercontent.com/redhat-developer/devfile/master/getting-started/quarkus/devfile.yaml[Iniciar el espacio de trabajo de Che]

source: https://cloud.google.com/[A Google Cloud Account]. Free accounts work.
es_es: https://cloud.google.com/[Una cuenta de Google Cloud]. Las cuentas gratuitas funcionan.

source: https://cloud.google.com/sdk[Cloud SDK CLI Installed]
es_es: https://cloud.google.com/sdk[Cloud SDK CLI instalado]

source: https://devcenter.heroku.com/articles/heroku-cli[Heroku CLI installed]
es_es: https://devcenter.heroku.com/articles/heroku-cli[Heroku CLI instalado]

source: https://docs.microsoft.com/en-us/azure/aks/tutorial-kubernetes-deploy-cluster?WT.mc_id=opensource-quarkus-brborges[Tutorial: Deploy an Azure Kubernetes Service (AKS) cluster]
es_es: https://docs.microsoft.com/en-us/azure/aks/tutorial-kubernetes-deploy-cluster?WT.mc_id=opensource-quarkus-brborges[Tutorial: Despliegue de un clúster de Azure Kubernetes Service (AKS)]

source: https://docs.microsoft.com/en-us/azure/app-service/containers/tutorial-custom-docker-image?WT.mc_id=opensource-quarkus-brborges[Tutorial: Build a custom image and run in App Service from a private registry]
es_es: https://docs.microsoft.com/en-us/azure/app-service/containers/tutorial-custom-docker-image?WT.mc_id=opensource-quarkus-brborges[Tutorial: Construir una imagen personalizada y ejecutarla en App Service desde un registro privado]

source: https://docs.microsoft.com/en-us/azure/container-instances/container-instances-using-azure-container-registry?WT.mc_id=opensource-quarkus-brborges[Deploy to Azure Container Instances from Azure Container Registry]
es_es: https://docs.microsoft.com/en-us/azure/container-instances/container-instances-using-azure-container-registry?WT.mc_id=opensource-quarkus-brborges[Despliegue en Instancias de Contenedores Azure desde el Registro de Contenedores Azure]

source: https://docs.microsoft.com/en-us/cli/azure/install-azure-cli[Azure CLI Installed]
es_es: https://docs.microsoft.com/en-us/cli/azure/install-azure-cli[Azure CLI instalado]

source: https://download.jboss.org/jbosstools/photon/snapshots/builds/jbosstools-quarkus_master/[Development Update Site]
es_es: https://download.jboss.org/jbosstools/photon/snapshots/builds/jbosstools-quarkus_master/[Sitio de actualización del desarrollo]

source: https://github.com/redhat-developer/quarkus-ls[Quarkus Language Server]
es_es: https://github.com/redhat-developer/quarkus-ls[Servidor de idiomas Quarkus]

source: https://marketplace.eclipse.org/content/quarkus-tools[Quarkus Tools for Eclipse]
es_es: https://marketplace.eclipse.org/content/quarkus-tools[Herramientas Quarkus para Eclipse]

source: https://marketplace.visualstudio.com/items?itemName=redhat.vscode-quarkus[Quarkus Tools for Visual Studio Code]
es_es: https://marketplace.visualstudio.com/items?itemName=redhat.vscode-quarkus[Herramientas Quarkus para Visual Studio Code]

source: https://vertx.io/docs/apidocs/io/vertx/core/json/JsonObject.html[`JsonObject`] or https://vertx.io/docs/apidocs/io/vertx/core/json/JsonArray.html[`JsonArray`]
es_es: https://vertx.io/docs/apidocs/io/vertx/core/json/JsonObject.html[`JsonObject`] o link:https://vertx.io/docs/apidocs/io/vertx/core/json/JsonArray.html[`JsonArray`]

source: https://www.graalvm.org[GraalVM] is a universal virtual machine for running applications written in various different languages, as well as providing the ability to compile JVM bytecode to a native executable (this native executable runs a special virtual machine called SubstrateVM). These native executables start much faster and can use a lot less memory than a traditional JVM, however not every JVM feature is supported, and some are more limited than normal.
es_es: https://www.graalvm.org[GraalVM] es una máquina virtual universal para ejecutar aplicaciones escritas en varios lenguajes diferentes, además de brindar la capacidad de compilar código de bytes JVM en un ejecutable nativo (este ejecutable nativo ejecuta una maquina virtual especial llamada SubstrateVM). Estos ejecutables nativos se inician mucho más rápido y pueden usar mucha menos memoria que una JVM tradicional, sin embargo, no todas las funciones de JVM son compatibles y algunas son más limitadas de lo normal.

source: https://www.heroku.com/[A Heroku Account]. Free accounts work.
es_es: https://www.heroku.com/[Una cuenta de Heroku]. Las cuentas gratuitas funcionan.

source: https://www.jetbrains.com/idea/nextversion/[Installer]
es_es: https://www.jetbrains.com/idea/nextversion/[Instalador]

source: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.inline-ctes]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.inline-ctes[quarkus.blaze-persistence.inline-ctes]` [.description] -- If set to true, the CTE queries are inlined by default. Valid values for this property are `true`, `false` or `auto`. Default is `true` which will always inline non-recursive CTEs. The `auto` configuration will only make use of inlining if the JPA provider and DBMS dialect support/require it. The property can be changed for a criteria builder before constructing a query. --
es_es: icon:lock[title=Fixed at build time] [[quarkus-blaze-persistence_quarkus.blaze-persistence.inline-ctes]]`link:#quarkus-blaze-persistence_quarkus.blaze-persistence.inline-ctes[quarkus.blaze-persistence.inline-ctes]` [.description] -- Si se establece como true, las consultas CTE se alinean por defecto. Los valores válidos para esta propiedad son `true`, `false` o `auto`. El valor por defecto es `true`, que siempre alineará las CTEs no recursivas. La configuración `auto` sólo hará uso del inlining si el proveedor JPA y el dialecto del DBMS lo soportan/requieren. La propiedad puede ser cambiada para un constructor de criterios antes de construir una consulta. --

source: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.shared]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.shared[quarkus.kogito.devservices.shared]` [.description] -- Indicates if the Data Index instance managed by Quarkus Dev Services is shared. When shared, Quarkus looks for running containers using label-based service discovery. If a matching container is found, it is used, and so a second one is not started. Otherwise, Dev Services for Kogito starts a new container. The discovery uses the `kogito-dev-service-data-index` label. The value is configured using the service-name property. Container sharing is only used in dev mode. --
es_es: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.shared]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.shared[quarkus.kogito.devservices.shared]` [.description] -- Indica si la instancia de Data Index gestionada por Quarkus Dev Services es compartida. Cuando se comparte, Quarkus busca contenedores en ejecución utilizando el descubrimiento de servicios basado en etiquetas. Si se encuentra un contenedor que coincida, se utiliza, por lo que no se inicia un segundo. En caso contrario, Dev Services for Kogito inicia un nuevo contenedor. El descubrimiento utiliza la etiqueta `kogito-dev-service-data-index`. El valor se configura mediante la propiedad service-name. La compartición de contenedores sólo se utiliza en el modo dev. --

source: image:{eclipse-logo}[Eclipse,100,100] {empty} + Eclipse Quarkus Tools
es_es: image:{eclipse-logo}[Eclipse,100,100] {empty} + Herramientas Eclipse Quarkus

source: image:{intellij-logo}[IntelliJ,100,100] {empty} + IntelliJ Quarkus Tools
es_es: image:{intellij-logo}[IntelliJ,100,100] {empty} + Herramientas IntelliJ Quarkus

source: image:{vscode-logo}[VSCode,100,100] {empty} + VSCode Quarkus Tools
es_es: image:{vscode-logo}[VSCode,100,100] {empty} + Herramientas VSCode Quarkus

source: import the project in your favorite IDE
es_es: importar el proyecto en su IDE favorito

source: increases the startup RSS usage of the application
es_es: aumenta el uso de RSS de inicio de la aplicación

source: increases your build time, mainly if you use high-compression levels
es_es: aumenta el tiempo de construcción, sobre todo si se utilizan niveles de compresión elevados

source: integrates with the reactive engine from Quarkus as well as the reactive development model
es_es: se integra con el motor reactivo de Quarkus, así como con el modelo de desarrollo reactivo

source: or <a href="https://gradle.org/" target="_blank">Gradle</a>
es_es: o <a href="https://gradle.org/" target="_blank">Gradle</a>

source: or for native:
es_es: o para los nativos:

source: or to have built the native executable using an in-container build.
es_es: o haber construido el ejecutable nativo utilizando una construcción en el contenedor.

source: primitive types or `String`
es_es: tipos primitivos o `String`

source: provide feedback on https://github.com/quarkusio/quarkus/issues[GitHub];
es_es: proporcionar retroalimentación en https://github.com/quarkusio/quarkus/issues[GitHub];

source: provided capability name
es_es: nombre de la capacidad proporcionada

source: runtime Quarkus extension artifact ID, in our example `quarkus-extension-a`
es_es: ID del artefacto de extensión de Quarkus en tiempo de ejecución, en nuestro ejemplo `quarkus-extension-a`

source: runtime Quarkus extension artifact ID, in our example `quarkus-extension-b`;
es_es: ID del artefacto de extensión de Quarkus en tiempo de ejecución, en nuestro ejemplo `quarkus-extension-b`;

source: scaffold a project in a single command line
es_es: armar un proyecto en una sola línea de comandos

source: set `use-anonymous-sender` to false
es_es: establecer `use-anonymous-sender` en falso

source: set the destination address (anonymous sender are not supported)
es_es: establecer la dirección de destino (no se admiten remitentes anónimos)

source: small (based on `ubi8-micro`)
es_es: pequeño (basado en `ubi8-micro`)

source: support upx-compressed executables (more details on the xref:upx.adoc[enabling compression documentation])
es_es: soportar los ejecutables comprimidos por upx (más detalles en la xref:upx.adoc[documentación sobre la habilitación de la compresión])

source: supports consuming gRPC services
es_es: soporta el consumo de servicios gRPC

source: supports https://grpc.github.io/grpc-java/javadoc/io/grpc/inprocess/InProcessServerBuilder.html[InProcess] gRPC development
es_es: admite el desarrollo de gRPC https://grpc.github.io/grpc-java/javadoc/io/grpc/inprocess/InProcessServerBuilder.html[en proceso]

source: supports https://grpc.github.io/grpc/core/md_doc_grpc_xds_features.html[xDS gRPC] integration
es_es: admite la integración https://grpc.github.io/grpc/core/md_doc_grpc_xds_features.html[xDS gRPC]

source: supports implementing gRPC services
es_es: apoya la implementación de los servicios gRPC

source: the Maven structure
es_es: la estructura de Maven
